{
  "id": "c71dff7c-4fa8-4f6d-b810-5c7474bf24d2",
  "title": "🔮 Тайна Древних Рун",
  "description": "История о юной волшебнице, которая обнаруживает редкую способность читать древние руны и раскрывает заговор в Министерстве магии",
  "language": "ru",
  "startId": 1,
  "nodes": [
    {
      "id": 1,
      "type": "skip",
      "label": "Экскурсия",
      "text": [
        "Лондон, 2005 год. Вы стоите в вестибюле Министерства магии, окружённая группой учеников Хогвартса. 🏛️",
        "Ваше имя - Алиса Рейнсфорд, и сегодня у вас экскурсия по самому сердцу магического правительства. Гид ведёт группу к лифту."
      ],
      "position": [100, 100],
      "nextId": 2
    },
    {
      "id": 2,
      "type": "action",
      "label": "Древние руны",
      "text": [
        "Вдруг вы замечаете странные символы на стенах - древние руны, которые, кажется, <i>двигаются</i>. ✨",
        "Никто из ваших одноклассников их не видит, но для вас они светятся ярким светом."
      ],
      "position": [400, 100],
      "actions": [
        {
          "label": "🔍 Прикоснуться",
          "id": 3
        },
        {
          "label": "👀 Наблюдать",
          "id": 4
        },
        {
          "label": "🚶 Игнорировать",
          "id": 5
        }
      ]
    },
    {
      "id": 3,
      "type": "skip",
      "label": "Видение",
      "text": [
        "Как только вы касаетесь рун, мир вокруг исчезает. Вы видите тёмную комнату в подземельях Министерства. 🌌",
        "Трое людей в мантиях обсуждают что-то важное. Один из них упоминает \"возвращение древней магии\"."
      ],
      "position": [700, 50],
      "nextId": 6
    },
    {
      "id": 4,
      "type": "skip",
      "label": "Наблюдение",
      "text": [
        "Руны начинают светиться ярче, и вы видите тусклое видение - тёмную фигуру, скрывающуюся в углу. 👁️",
        "Кто-то наблюдает за вашей группой, но никто этого не замечает."
      ],
      "position": [700, 150],
      "nextId": 6
    },
    {
      "id": 5,
      "type": "skip",
      "label": "Игнорирование",
      "text": [
        "Вы решаете не обращать внимания на странные руны. Но они продолжают светиться, привлекая ваше внимание. 💫",
        "Внезапно вы слышите шёпот: \"Она может видеть нас...\""
      ],
      "position": [700, 250],
      "nextId": 6
    },
    {
      "id": 6,
      "type": "action",
      "label": "Возвращение",
      "text": [
        "Видение исчезает, и вы снова в вестибюле. Гид продолжает экскурсию, но вы не можете перестать думать о рунах. 🤔",
        "Что это было? И почему только вы смогли это увидеть?"
      ],
      "position": [1000, 100],
      "actions": [
        {
          "label": "📚 Изучить руны",
          "id": 7
        },
        {
          "label": "🤫 Держать в секрете",
          "id": 8
        }
      ]
    },
    {
      "id": 7,
      "type": "skip",
      "label": "Библиотека",
      "text": [
        "Вернувшись в Хогвартс, вы идёте в библиотеку искать книги о древних рунах. 📖",
        "Мадам Пинс помогает найти редкие фолианты по археомагии."
      ],
      "position": [1300, 50],
      "nextId": 9
    },
    {
      "id": 8,
      "type": "skip",
      "label": "Секрет",
      "text": [
        "Вы решаете никому не рассказывать о странном опыте. Но руны продолжают появляться в ваших снах. 😴",
        "Каждую ночь вы видите новые видения из прошлого Министерства."
      ],
      "position": [1300, 150],
      "nextId": 9
    },
    {
      "id": 9,
      "type": "action",
      "label": "Открытие",
      "text": [
        "В книгах вы находите упоминание о \"Читателях Рун\" - редких волшебниках, способных видеть прошлое через древние символы. 🔮",
        "Но последний известный Читатель исчез сто лет назад. Что это значит?"
      ],
      "position": [1600, 100],
      "actions": [
        {
          "label": "🔍 Искать больше",
          "id": 10
        },
        {
          "label": "👥 Рассказать другу",
          "id": 11
        }
      ]
    },
    {
      "id": 10,
      "type": "skip",
      "label": "Глубже",
      "text": [
        "Вы находите упоминание о секретном отделе Министерства - \"Отделе Древних Артефактов\". 🏛️",
        "Согласно записям, они изучают древнюю магию, но их деятельность строго засекречена."
      ],
      "position": [1900, 50],
      "nextId": 12
    },
    {
      "id": 11,
      "type": "action",
      "label": "Доверие",
      "text": [
        "Вы решаете рассказать о своих способностях лучшей подруге Мире. Она сначала не верит, но потом соглашается помочь. 👭",
        "\"Если ты действительно можешь видеть прошлое через руны, это может быть опасно,\" - говорит она."
      ],
      "position": [1900, 150],
      "actions": [
        {
          "label": "🤝 Принять помощь",
          "id": 12
        },
        {
          "label": "🚫 Отказаться",
          "id": 13
        }
      ]
    },
    {
      "id": 12,
      "type": "action",
      "label": "План",
      "text": [
        "Вместе с Мирой вы разрабатываете план: нужно вернуться в Министерство и найти больше рун для изучения. 📋",
        "Но как попасть туда без приглашения?"
      ],
      "position": [2200, 100],
      "actions": [
        {
          "label": "🎭 Под прикрытием",
          "id": 14
        },
        {
          "label": "📝 Официально",
          "id": 15
        }
      ]
    },
    {
      "id": 13,
      "type": "skip",
      "label": "Одиночество",
      "text": [
        "Вы решаете действовать в одиночку. Это рискованно, но вы не хотите подвергать друзей опасности. 🚶‍♀️",
        "Ночью вы прокрадываетесь в библиотеку, чтобы найти способ попасть в Министерство."
      ],
      "position": [2200, 200],
      "nextId": 16
    },
    {
      "id": 14,
      "type": "skip",
      "label": "Маскировка",
      "text": [
        "Мира помогает вам создать поддельные документы стажёра Министерства. 🎭",
        "Вы надеваете мантию и идёте к входу в Министерство, надеясь, что никто не проверит документы слишком внимательно."
      ],
      "position": [2500, 50],
      "nextId": 17
    },
    {
      "id": 15,
      "type": "action",
      "label": "Заявление",
      "text": [
        "Вы пишете официальное заявление о стажировке в Министерстве магии. 📝",
        "К вашему удивлению, через неделю приходит положительный ответ."
      ],
      "position": [2500, 150],
      "actions": [
        {
          "label": "✅ Принять",
          "id": 17
        },
        {
          "label": "❌ Отклонить",
          "id": 18
        }
      ]
    },
    {
      "id": 16,
      "type": "redirect",
      "label": "Ночное проникновение",
      "text": [
        "Вы находите в книгах способ проникнуть в Министерство через старые туннели. 🌙",
        "Но это очень опасно - если вас поймают, вас исключат из школы."
      ],
      "position": [2500, 250],
      "links": [
        {
          "id": 17,
          "weight": 7
        },
        {
          "id": 19,
          "weight": 3
        }
      ]
    },
    {
      "id": 17,
      "type": "skip",
      "label": "В Министерстве",
      "text": [
        "Вы снова в Министерстве магии, но на этот раз официально. Секретарь проводит вас в отдел кадров. 🏢",
        "По пути вы замечаете больше рун на стенах - они светятся ярче, чем в прошлый раз."
      ],
      "position": [2800, 100],
      "nextId": 20
    },
    {
      "id": 18,
      "type": "finish",
      "label": "Отказ",
      "text": [
        "Вы решаете не рисковать и отказываетесь от стажировки. 🚫",
        "Руны продолжают появляться в ваших снах, но вы никогда не узнаете, что происходило в Министерстве. Возможно, это к лучшему."
      ],
      "position": [2800, 200]
    },
    {
      "id": 19,
      "type": "finish",
      "label": "Поймана",
      "text": [
        "Вас ловят при попытке проникнуть в Министерство через туннели. 🚨",
        "Вас исключают из Хогвартса, и ваши способности остаются нераскрытыми. Заговор в Министерстве продолжается."
      ],
      "position": [2800, 300]
    },
    {
      "id": 20,
      "type": "action",
      "label": "Новое видение",
      "text": [
        "В отделе кадров вы видите руны на столе чиновника. Прикоснувшись к ним, вы видите видение. 🔮",
        "Тот же человек из первого видения говорит: \"Она должна быть устранена. Читатели Рун слишком опасны.\""
      ],
      "position": [3100, 100],
      "actions": [
        {
          "label": "😱 Испугаться",
          "id": 21
        },
        {
          "label": "⚡ Действовать",
          "id": 22
        }
      ]
    },
    {
      "id": 21,
      "type": "skip",
      "label": "Паника",
      "text": [
        "Вы в панике покидаете Министерство. Кто-то знает о ваших способностях и хочет вас устранить! 😰",
        "Но бежать некуда - они знают, что вы из Хогвартса."
      ],
      "position": [3400, 50],
      "nextId": 23
    },
    {
      "id": 22,
      "type": "skip",
      "label": "Смелость",
      "text": [
        "Вместо страха вы чувствуете гнев. Кто-то хочет вас устранить только за то, что вы можете читать руны! ⚡",
        "Вы решаете найти этих людей и разоблачить их заговор."
      ],
      "position": [3400, 150],
      "nextId": 24
    },
    {
      "id": 23,
      "type": "action",
      "label": "Убежище",
      "text": [
        "Вы возвращаетесь в Хогвартс и прячетесь в библиотеке. Мира находит вас и предлагает помощь. 🏰",
        "\"Мы должны найти способ защитить тебя,\" - говорит она."
      ],
      "position": [3700, 50],
      "actions": [
        {
          "label": "🛡️ Принять защиту",
          "id": 25
        },
        {
          "label": "⚔️ Контратаковать",
          "id": 26
        }
      ]
    },
    {
      "id": 24,
      "type": "skip",
      "label": "Охота",
      "text": [
        "Вы решаете найти заговорщиков. Руны показывают вам путь к секретному отделу в подземельях Министерства. 🕵️‍♀️",
        "Но для этого нужно проникнуть туда незамеченной."
      ],
      "position": [3700, 150],
      "nextId": 27
    },
    {
      "id": 25,
      "type": "skip",
      "label": "Защита",
      "text": [
        "Мира помогает вам создать защитные заклинания и находит информацию о том, как скрыть свои способности. 🛡️",
        "Но это временное решение - заговорщики всё равно найдут вас."
      ],
      "position": [4000, 50],
      "nextId": 28
    },
    {
      "id": 26,
      "type": "skip",
      "label": "Атака",
      "text": [
        "Вы решаете нанести удар первыми. С помощью рун вы находите слабое место в защите Министерства. ⚔️",
        "Но это очень рискованно - если что-то пойдёт не так, вас арестуют."
      ],
      "position": [4000, 150],
      "nextId": 29
    },
    {
      "id": 27,
      "type": "action",
      "label": "Проникновение",
      "text": [
        "Вы используете руны, чтобы найти секретный проход в подземелья Министерства. 🚪",
        "Руны светятся, указывая путь через старые туннели."
      ],
      "position": [4000, 250],
      "actions": [
        {
          "label": "🚶 Идти",
          "id": 30
        },
        {
          "label": "⏰ Подождать",
          "id": 31
        }
      ]
    },
    {
      "id": 28,
      "type": "redirect",
      "label": "Скрытие",
      "text": [
        "Вы решаете скрыться в Хогвартсе и надеяться, что заговорщики не найдут вас. 🏰",
        "Но сможете ли вы жить в страхе всю жизнь?"
      ],
      "position": [4300, 50],
      "links": [
        {
          "id": 32,
          "weight": 6
        },
        {
          "id": 33,
          "weight": 4
        }
      ]
    },
    {
      "id": 29,
      "type": "skip",
      "label": "Риск",
      "text": [
        "Вы прокрадываетесь в Министерство ночью, используя руны для навигации. 🌙",
        "В подземельях вы слышите голоса - заговорщики здесь!"
      ],
      "position": [4300, 150],
      "nextId": 34
    },
    {
      "id": 30,
      "type": "skip",
      "label": "Туннели",
      "text": [
        "Вы идёте по тёмным туннелям, освещая путь рунами. Впереди слышны голоса. 🕯️",
        "Руны показывают, что вы приближаетесь к секретной комнате."
      ],
      "position": [4300, 250],
      "nextId": 35
    },
    {
      "id": 31,
      "type": "action",
      "label": "Ожидание",
      "text": [
        "Вы решаете подождать и собрать больше информации. Возможно, есть более безопасный способ. ⏰",
        "Но время работает против вас - заговорщики могут действовать прямо сейчас."
      ],
      "position": [4600, 250],
      "actions": [
        {
          "label": "📊 Собрать данные",
          "id": 36
        },
        {
          "label": "⚡ Действовать сейчас",
          "id": 30
        }
      ]
    },
    {
      "id": 32,
      "type": "finish",
      "label": "Скрытая жизнь",
      "text": [
        "Вы решаете скрыться и жить в страхе. Ваши способности остаются неиспользованными. 😔",
        "Заговор в Министерстве продолжается, но вы в безопасности. Иногда вы задаётесь вопросом, правильно ли поступили."
      ],
      "position": [4600, 50]
    },
    {
      "id": 33,
      "type": "finish",
      "label": "Обнаружена",
      "text": [
        "Заговорщики находят вас в Хогвартсе. Вас похищают и заточают в подземельях Министерства. 🚨",
        "Ваши способности используются для их целей, а вы становитесь их пленницей."
      ],
      "position": [4600, 100]
    },
    {
      "id": 34,
      "type": "action",
      "label": "Заговорщики",
      "text": [
        "Вы подслушиваете разговор трёх людей в мантиях. Они обсуждают план по возрождению древней магии. 🗣️",
        "\"Читатель Рун может помешать нашим планам,\" - говорит один из них."
      ],
      "position": [4900, 150],
      "actions": [
        {
          "label": "🎭 Войти",
          "id": 37
        },
        {
          "label": "📝 Записать",
          "id": 38
        }
      ]
    },
    {
      "id": 35,
      "type": "skip",
      "label": "Секретная комната",
      "text": [
        "Вы входите в огромную комнату, покрытую древними рунами. В центре стоит алтарь с тёмным кристаллом. 💎",
        "Руны показывают вам видения прошлого - здесь проводились ритуалы древней магии."
      ],
      "position": [4900, 250],
      "nextId": 39
    },
    {
      "id": 36,
      "type": "skip",
      "label": "Исследование",
      "text": [
        "Вы изучаете документы и находите информацию о заговоре. Заговорщики хотят использовать древнюю магию для контроля. 📊",
        "Но у вас недостаточно доказательств, чтобы их остановить."
      ],
      "position": [5200, 250],
      "nextId": 40
    },
    {
      "id": 37,
      "type": "action",
      "label": "Конфронтация",
      "text": [
        "Вы входите в комнату и заговорщики замечают вас. \"Читатель Рун!\" - восклицает один из них. ⚡",
        "Теперь у вас есть выбор - бороться или попытаться договориться."
      ],
      "position": [5200, 150],
      "actions": [
        {
          "label": "⚔️ Бороться",
          "id": 41
        },
        {
          "label": "🤝 Договориться",
          "id": 42
        }
      ]
    },
    {
      "id": 38,
      "type": "skip",
      "label": "Доказательства",
      "text": [
        "Вы записываете всё, что слышите, и уходите незамеченной. Теперь у вас есть доказательства заговора. 📝",
        "Но что делать с этой информацией?"
      ],
      "position": [5200, 200],
      "nextId": 43
    },
    {
      "id": 39,
      "type": "action",
      "label": "Кристалл",
      "text": [
        "Вы подходите к тёмному кристаллу. Руны вокруг него показывают страшные видения - кристалл может поглотить магию. 💎",
        "Заговорщики хотят использовать его для контроля над всеми волшебниками."
      ],
      "position": [5500, 250],
      "actions": [
        {
          "label": "💥 Разрушить",
          "id": 44
        },
        {
          "label": "🔮 Изучить",
          "id": 45
        }
      ]
    },
    {
      "id": 40,
      "type": "action",
      "label": "Недостаточно",
      "text": [
        "У вас есть подозрения, но недостаточно доказательств. Заговорщики могут отрицать всё. 🤷‍♀️",
        "Нужно найти более убедительные улики или действовать по-другому."
      ],
      "position": [5500, 100],
      "actions": [
        {
          "label": "🔍 Искать больше",
          "id": 46
        },
        {
          "label": "⚡ Действовать",
          "id": 37
        }
      ]
    },
    {
      "id": 41,
      "type": "redirect",
      "label": "Битва",
      "text": [
        "Вы вступаете в магическую битву с заговорщиками. Ваши способности чтения рун дают вам преимущество. ⚔️",
        "Но трое против одного - это неравный бой."
      ],
      "position": [5800, 150],
      "links": [
        {
          "id": 47,
          "weight": 4
        },
        {
          "id": 48,
          "weight": 6
        }
      ]
    },
    {
      "id": 42,
      "type": "action",
      "label": "Переговоры",
      "text": [
        "\"Может быть, мы можем договориться?\" - говорите вы. Заговорщики обмениваются взглядами. 🤝",
        "\"Что ты предлагаешь?\" - спрашивает один из них."
      ],
      "position": [5800, 200],
      "actions": [
        {
          "label": "💰 Присоединиться",
          "id": 49
        },
        {
          "label": "🛡️ Защита",
          "id": 50
        }
      ]
    },
    {
      "id": 43,
      "type": "action",
      "label": "Выбор",
      "text": [
        "У вас есть доказательства заговора. Что делать дальше? 📋",
        "Можно пойти к властям или попытаться остановить заговорщиков самостоятельно."
      ],
      "position": [5800, 250],
      "actions": [
        {
          "label": "👮 Власти",
          "id": 51
        },
        {
          "label": "⚡ Самостоятельно",
          "id": 37
        }
      ]
    },
    {
      "id": 44,
      "type": "skip",
      "label": "Разрушение",
      "text": [
        "Вы направляете заклинание на кристалл. Он трескается и взрывается, освобождая поглощённую магию. 💥",
        "Заговорщики в ужасе смотрят на разрушенный алтарь."
      ],
      "position": [6100, 250],
      "nextId": 52
    },
    {
      "id": 45,
      "type": "skip",
      "label": "Изучение",
      "text": [
        "Вы изучаете кристалл через руны. Он содержит древнюю магию, которая может контролировать разум. 🔮",
        "Но вы также видите способ его безопасно деактивировать."
      ],
      "position": [6100, 300],
      "nextId": 53
    },
    {
      "id": 46,
      "type": "skip",
      "label": "Поиск",
      "text": [
        "Вы продолжаете искать доказательства, но заговорщики замечают ваше присутствие. 🕵️‍♀️",
        "Теперь у вас нет выбора - нужно действовать немедленно."
      ],
      "position": [6100, 100],
      "nextId": 37
    },
    {
      "id": 47,
      "type": "finish",
      "label": "Победа",
      "text": [
        "Несмотря на неравные силы, вы побеждаете заговорщиков с помощью своих способностей чтения рун! 🏆",
        "Вы разоблачаете заговор и становитесь героиней. Ваши способности признаны и защищены."
      ],
      "position": [6400, 150]
    },
    {
      "id": 48,
      "type": "finish",
      "label": "Поражение",
      "text": [
        "Заговорщики оказываются сильнее. Вас захватывают и заточают в подземельях. 🚨",
        "Ваши способности используются для их целей, а заговор продолжается."
      ],
      "position": [6400, 200]
    },
    {
      "id": 49,
      "type": "finish",
      "label": "Компромисс",
      "text": [
        "Вы договариваетесь с заговорщиками. Они дают вам долю в их планах в обмен на ваши способности. 🤝",
        "Вы получаете власть и богатство, но теряете свою честь. Заговор продолжается с вашим участием."
      ],
      "position": [6400, 250]
    },
    {
      "id": 50,
      "type": "skip",
      "label": "Защита",
      "text": [
        "\"Я могу помочь вам, но только если вы откажетесь от контроля над другими,\" - говорите вы. 🛡️",
        "Заговорщики колеблются. Возможно, есть способ найти компромисс."
      ],
      "position": [6400, 300],
      "nextId": 54
    },
    {
      "id": 51,
      "type": "action",
      "label": "Власти",
      "text": [
        "Вы идёте к директору Хогвартса с доказательствами заговора. Минерва МакГонагалл внимательно слушает. 👮",
        "\"Это серьёзные обвинения,\" - говорит она. \"Нужно действовать осторожно.\""
      ],
      "position": [6400, 350],
      "actions": [
        {
          "label": "⚡ Немедленно",
          "id": 55
        },
        {
          "label": "⏰ Подождать",
          "id": 56
        }
      ]
    },
    {
      "id": 52,
      "type": "finish",
      "label": "Героиня",
      "text": [
        "Кристалл разрушен, заговорщики арестованы. Вы спасли магический мир от контроля! 🏆",
        "Ваши способности чтения рун признаны и защищены. Вы становитесь известной как героиня."
      ],
      "position": [6700, 250]
    },
    {
      "id": 53,
      "type": "action",
      "label": "Деактивация",
      "text": [
        "Вы используете свои знания рун, чтобы безопасно деактивировать кристалл. Магия освобождается без взрыва. ✨",
        "Заговорщики в шоке - их план разрушен, но никто не пострадал."
      ],
      "position": [6700, 300],
      "actions": [
        {
          "label": "🛡️ Мирно",
          "id": 57
        },
        {
          "label": "⚡ Атаковать",
          "id": 58
        }
      ]
    },
    {
      "id": 54,
      "type": "finish",
      "label": "Реформа",
      "text": [
        "Заговорщики соглашаются на ваши условия. Вместо контроля они создают совет по изучению древней магии. 🤝",
        "Вы помогаете им использовать свои знания во благо, а не во зло."
      ],
      "position": [6700, 350]
    },
    {
      "id": 55,
      "type": "skip",
      "label": "Рейд",
      "text": [
        "МакГонагалл организует рейд на Министерство. Авроры окружают подземелья и арестовывают заговорщиков. 👮",
        "Заговор раскрыт, но заговорщики успевают уничтожить некоторые улики."
      ],
      "position": [7000, 350],
      "nextId": 59
    },
    {
      "id": 56,
      "type": "skip",
      "label": "Ожидание",
      "text": [
        "МакГонагалл решает действовать осторожно и собирает больше доказательств. ⏰",
        "Но пока вы ждёте, заговорщики могут завершить свои планы."
      ],
      "position": [7000, 400],
      "nextId": 60
    },
    {
      "id": 57,
      "type": "finish",
      "label": "Мудрость",
      "text": [
        "Вы убеждаете заговорщиков сдаться мирно. Они признают свою вину и помогают восстановить справедливость. 🕊️",
        "Ваша мудрость и способности чтения рун спасают всех от кровопролития."
      ],
      "position": [7000, 300]
    },
    {
      "id": 58,
      "type": "redirect",
      "label": "Атака",
      "text": [
        "Вы атакуете заговорщиков, пока они в шоке от деактивации кристалла. ⚔️",
        "Теперь у вас есть преимущество, но бой всё ещё опасен."
      ],
      "position": [7000, 250],
      "links": [
        {
          "id": 47,
          "weight": 7
        },
        {
          "id": 48,
          "weight": 3
        }
      ]
    },
    {
      "id": 59,
      "type": "finish",
      "label": "Победа с помощью",
      "text": [
        "Заговор раскрыт благодаря вашим доказательствам! Заговорщики арестованы, а ваши способности признаны. 🏆",
        "Вы получаете награду от Министерства за помощь в раскрытии заговора."
      ],
      "position": [7300, 350]
    },
    {
      "id": 60,
      "type": "finish",
      "label": "Поздно",
      "text": [
        "Пока власти собирают доказательства, заговорщики завершают свой план. Кристалл активирован. 😔",
        "Магический мир попадает под контроль, а вы не смогли это предотвратить."
      ],
      "position": [7300, 400]
    }
  ]
}
